src/conf/InformationRegisters/уп_ГрафикРаботы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<InformationRegister>
		<Properties>
			<Name>уп_ГрафикРаботы</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Процедура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Процедуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_СостоянияГрафика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Помещения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВремяНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/conf/Documents/уп_ПредварительнаяЗапись.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Document>
		<Properties>
			<Name>уп_ПредварительнаяЗапись</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.уп_ГрафикРаботы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВремяНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Помещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Процедуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Неявка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подтверждение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/conf/Catalogs/Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Catalog>
		<Properties>
			<Name>Контрагенты</Name>
			<Comment>Клиент</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорПоУмолчанию</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уп_Сделка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтранаРегистрации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Comment>Свойство</Comment>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Comment>Значение</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Comment>Тип</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Comment>Вид</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Comment>Представление</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Родственники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Родство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уп_КлассификаторРодства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/conf/CommonModules/уп_ПредварительнаяЗапись/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Модуль Предварительная запись
// Обеспечивает работу механизма предварительной записи
//  
////////////////////////////////////////////////////////////////////////////////
#Область ПрограммныйИнтерфейс

// Удаление документа Предварительная запись с проверкой ссылок на удаляемый документ.
Функция УдалитьПредварительнуюЗапись(ДокументСсылка) Экспорт
	
	РезультатУдаления = Ложь;
	
	Если Не ЗначениеЗаполнено(ДокументСсылка) Тогда 
		Возврат Истина;	
	КонецЕсли;	
	
    УдаляемыеОбъекты = Новый Массив;
    УдаляемыеОбъекты.Добавить(ДокументСсылка);
	
	УстановитьПривилегированныйРежим(Истина);
	
	НайденныеСсылки = НайтиПоСсылкам(УдаляемыеОбъекты); 
 
    Если НайденныеСсылки.Количество() > 1 Тогда
		ТекстСообщения = НСтр("ru='Имеются ссылки на документ!'");
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ТекстСообщения;
		Сообщение.Сообщить();
		РезультатУдаления = Ложь;
	Иначе 
		Попытка
    		ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
    		ДокументОбъект.Удалить(); 
			РезультатУдаления = Истина;
		Исключение 
			РезультатУдаления = Ложь;
    	КонецПопытки;
    КонецЕсли; 
    
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат РезультатУдаления;   
	
Конецфункции

// Получение расписания приема.
Функция ПолучитьРасписаниеПриема(ДатаНачала, ДатаОкончания, КратностьВремениЗаписи, СотрудникКабиентПереключатель, СписокЗначенийОтбора) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаписьНаПрием.Сотрудник КАК Измерение,
	|	НАЧАЛОПЕРИОДА(ЗаписьНаПрием.Период, ДЕНЬ) КАК Период
	|ИЗ
	|	РегистрСведений.уп_ГрафикРаботы КАК ЗаписьНаПрием
	|ГДЕ
	|	ЗаписьНаПрием.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И НЕ ЗаписьНаПрием.Сотрудник = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	И ВЫБОР
	|			КОГДА &СотрудникКабиентПереключатель = ""Сотрудник""
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьОтбор
	|				ТОГДА ЗаписьНаПрием.Сотрудник В (&ОтборИзмерений)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаписьНаПрием.Сотрудник,
	|	НАЧАЛОПЕРИОДА(ЗаписьНаПрием.Период, ДЕНЬ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаписьНаПрием.Помещение,
	|	НАЧАЛОПЕРИОДА(ЗаписьНаПрием.Период, ДЕНЬ)
	|ИЗ
	|	РегистрСведений.уп_ГрафикРаботы КАК ЗаписьНаПрием
	|ГДЕ
	|	ЗаписьНаПрием.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И НЕ ЗаписьНаПрием.Помещение = ЗНАЧЕНИЕ(Справочник.Помещения.ПустаяСсылка)
	|	И ВЫБОР
	|			КОГДА &СотрудникКабиентПереключатель = ""Помещение""
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьОтбор
	|				ТОГДА ЗаписьНаПрием.Помещение В (&ОтборИзмерений)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаписьНаПрием.Помещение,
	|	НАЧАЛОПЕРИОДА(ЗаписьНаПрием.Период, ДЕНЬ)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период,
	|	Измерение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ЗаписьНаПрием.Период, ДЕНЬ) КАК Период,
	|	ЗаписьНаПрием.Регистратор КАК Регистратор,
	|	ЗаписьНаПрием.Состояние КАК ТипЗаписи,
	|	ЗаписьНаПрием.ВремяНачала,
	|	ЗаписьНаПрием.ВремяОкончания,
	|	ЗаписьНаПрием.Сотрудник КАК Сотрудник,
	|	ЗаписьНаПрием.Помещение,
	|	ЗаписьНаПрием.Клиент
//	|	ЗаписьНаПрием.Телефон КАК Телефон,
//	|	ЗаписьНаПрием.Подтверждение,
//	|	ЗаписьНаПрием.Неявка,
//	|	ЗаписьНаПрием.Первичная,
//	|	ЗаписьНаПрием.ВидПрочейЗаписи КАК ВидПрочейЗаписи,
//	|	ЗаписьНаПрием.Комментарий
	|ИЗ
	|	РегистрСведений.уп_ГрафикРаботы КАК ЗаписьНаПрием
	|ГДЕ
	|	ЗаписьНаПрием.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И НЕ ЗаписьНаПрием.Сотрудник = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	И ЗаписьНаПрием.Регистратор ССЫЛКА Документ.уп_ПредварительнаяЗапись
	|	И ВЫБОР
	|			КОГДА &СотрудникКабиентПереключатель = ""Сотрудник""
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьОтбор
	|				ТОГДА ЗаписьНаПрием.Сотрудник В (&ОтборИзмерений)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ЗаписьНаПрием.Период, ДЕНЬ),
	|	ЗаписьНаПрием.Регистратор,
	|	ЗаписьНаПрием.Состояние,
	|	ЗаписьНаПрием.ВремяНачала,
	|	ЗаписьНаПрием.ВремяОкончания,
	|	ЗаписьНаПрием.Сотрудник,
	|	ЗаписьНаПрием.Помещение,
	|	ЗаписьНаПрием.Клиент
//	|	ЗаписьНаПрием.Телефон,
//	|	ЗаписьНаПрием.Подтверждение,
//	|	ЗаписьНаПрием.Неявка,
//	|	ЗаписьНаПрием.Первичная,
//	|	ЗаписьНаПрием.ВидПрочейЗаписи,
//	|	ЗаписьНаПрием.Комментарий
	|ИЗ
	|	РегистрСведений.уп_ГрафикРаботы КАК ЗаписьНаПрием
	|ГДЕ
	|	ЗаписьНаПрием.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И НЕ ЗаписьНаПрием.Помещение = ЗНАЧЕНИЕ(Справочник.Помещения.ПустаяСсылка)
	|	И ЗаписьНаПрием.Регистратор ССЫЛКА Документ.уп_ПредварительнаяЗапись
	|	И ВЫБОР
	|			КОГДА &СотрудникКабиентПереключатель = ""Помещение""
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьОтбор
	|				ТОГДА ЗаписьНаПрием.Помещение В (&ОтборИзмерений)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период";
	
	Запрос.УстановитьПараметр("ДатаНачала", 	ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания",	ДатаОкончания);
	Запрос.УстановитьПараметр("ЕстьОтбор",		ЗначениеЗаполнено(СписокЗначенийОтбора));
	Запрос.УстановитьПараметр("ОтборИзмерений",	СписокЗначенийОтбора);
	Запрос.УстановитьПараметр("СотрудникКабиентПереключатель", СотрудникКабиентПереключатель);
		
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	// Притягивание времени начала записи к шкале времени.
	ТаблицаЭлементов = РезультатЗапроса[1].Выгрузить();
	
	Для Каждого ТекЭлемент из ТаблицаЭлементов Цикл 
		
		Если Не Минута(ТекЭлемент.ВремяНачала) / КратностьВремениЗаписи = Цел(Минута(ТекЭлемент.ВремяНачала) / КратностьВремениЗаписи) Тогда 
			ТекЭлемент.ВремяНачала =  '00010101' + Час(ТекЭлемент.ВремяНачала) * 60 * 60 + Окр(Минута(ТекЭлемент.ВремяНачала) / КратностьВремениЗаписи) * КратностьВремениЗаписи * 60;	
		КонецЕсли;
		
	КонецЦикла;
	
	СтруктураРезультата = Новый Структура;
	СтруктураРезультата.Вставить("АдресИзмерений",		ПоместитьВоВременноеХранилище(РезультатЗапроса[0].Выгрузить()));
	СтруктураРезультата.Вставить("АдресЭлементов", 		ПоместитьВоВременноеХранилище(ТаблицаЭлементов));

	Возврат СтруктураРезультата;
	
КонецФункции // ПолучитьРасписаниеПриема()

// Изменение некоторых параметров приёма.
Функция ИзменитьПараметрыПриема (ДокументСсылка, Параметры) Экспорт
	РезультатИзменения = Ложь;
	
	Если НЕ ЗначениеЗаполнено(ДокументСсылка) ИЛИ ТипЗнч(ДокументСсылка) <> Тип("ДокументСсылка.уп_ПредварительнаяЗапись") Тогда
		Возврат РезультатИзменения;
	КонецЕсли;
	
	ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
	Попытка 
		Для Каждого Реквизит Из Параметры Цикл
	//		Если Реквизит.Ключ = "ВремяНачала" Тогда
				
	//		Иначе
				ДокументОбъект[Реквизит.Ключ] = Реквизит.Значение;
				РезультатИзменения = Истина;
	//		КонецЕсли;
		КонецЦикла;
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
	Если РезультатИзменения Тогда
		Попытка
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			РезультатИзменения = Ложь;
		КонецПопытки;
	КонецЕсли;
	
	Возврат РезультатИзменения;
КонецФункции
#КонецОбласти
#Область СлужебныеПроцедурыИФункции
//Код процедур и функций
#КонецОбласти
